src/Reports/BalanceSheet.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Report>
		<Properties>
			<Name>BalanceSheet</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/AccountingRegisters/GeneralJournal.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<AccountingRegister>
		<Properties>
			<Name>GeneralJournal</Name>
			<ChartOfAccounts>ChartOfAccounts.ChartOfAccounts</ChartOfAccounts>
			<Correspondence>false</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AmountRC</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

src/Enums/AccountTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>AccountTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AccountsPayable</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AccountsReceivable</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AccumulatedDepreciation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Bank</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CostOfSales</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Equity</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Expense</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FixedAsset</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Income</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Inventory</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LongTermLiability</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherCurrentAsset</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherCurrentLiability</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherExpense</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherIncome</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherNonCurrentAsset</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/GeneralJournalEntry.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>GeneralJournalEntry</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.GeneralJournal</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Memo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTotalRC</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTotal</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DontWriteFCY</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>LineItems</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Account</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AccountDescription</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AmountDr</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AmountCr</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/Companies.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>Companies</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>USTaxID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SalesTaxCode</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SalesTaxCodes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Vendor1099</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FirstName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MiddleName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LastName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Country</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Countries</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>State</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.States</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Customer</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Vendor</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddressLine1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddressLine2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>City</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ZIP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExpenseAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncomeAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Bank</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Banks</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Website</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Notes</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Fax</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/ChartsOfAccounts/ChartOfAccounts.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<ChartOfAccounts>
		<Properties>
			<Name>ChartOfAccounts</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.Dimensions</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AccountType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AccountTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Category1099</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.USTaxCategories1099</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OtherComprehensiveIncome</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncomeTaxAccount</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CashFlowSection</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CashFlowSections</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

src/Reports/BalanceSheet/Ext/ObjectModule.bsl
Function BalanceSheet(Date) Export
		
	If Date = Date(1,1,1) Then
		Date = CurrentDate();		
	EndIf;
	
	PeriodLabel = Format(Date, "DLF=D");
	
	ReportDate = BegOfDay(Date) + 60 * 60 * 24;
	
	OurCompany = Catalogs.Companies.OurCompany;
	
	SpreadsheetDocument = New SpreadsheetDocument;
	Template = GetTemplate("Template");
	
	Header = Template.GetArea("Header");
	Header.Parameters.PeriodLabel = PeriodLabel;
	Header.Parameters.Company = GeneralFunctions.GetAttributeValue(OurCompany, "Name");
	SpreadsheetDocument.Put(Header);
	
	Reg = AccountingRegisters.GeneralJournal;
	
	// Creating the OCI transactions value table
	
	OCITransactions = New ValueTable();
	OCITransactions.Columns.Add("Account");
	OCITransactions.Columns.Add("AmountRC");
		
	// Assets header section
	
	AssetsHeader = Template.GetArea("AssetsHeader");
	SpreadsheetDocument.Put(AssetsHeader);
	
	// Accumulating other comprehensive income
	
	TotalOCI = 0;
	
	// Bank section	
	
	BankBalance = 0;
	
	Bank = Template.GetArea("Bank");
	
	Query = New Query("SELECT
	                  |	ChartOfAccounts.Ref
	                  |FROM
	                  |	ChartOfAccounts.ChartOfAccounts AS ChartOfAccounts
	                  |WHERE
	                  |	ChartOfAccounts.AccountType = VALUE(Enum.AccountTypes.Bank)
	                  |
	                  |ORDER BY
	                  |	ChartOfAccounts.Code");	
	
	QueryResult = Query.Execute();

	If QueryResult.IsEmpty() Then
	Else
		RecorderDataset = QueryResult.Choose();
		While RecorderDataset.Next() Do
			
			Filter = New Structure("Account", RecorderDataset.Ref);	
			RecordSelection = Reg.Balance(ReportDate,,Filter);
			
			NoOfRows = RecordSelection.Count();
			If NoOfRows = 0 Then
			Else
				
				AccountCurrency = RecorderDataset.Ref.Currency;
				ExchangeRate = GeneralFunctions.GetExchangeRate(Date, GeneralFunctionsReusable.DefaultCurrency(), AccountCurrency);

				BalanceClosingRate = 0;
				BalanceClosingRate = (RecordSelection.Total("AmountBalanceDr") - RecordSelection.Total("AmountBalanceCr")) * ExchangeRate; 
				
				Balance = 0;				
				Balance = RecordSelection.Total("AmountRCBalanceDr") - RecordSelection.Total("AmountRCBalanceCr");
				
				BankBalance = BankBalance + BalanceClosingRate;				
				
				AccountOCI = 0;
				AccountOCI = BalanceClosingRate - Balance;
				TotalOCI = TotalOCI + AccountOCI;
				
				If AccountOCI <> 0 Then						
					OCITransactionsRow = OCITransactions.Add();
					OCITransactionsRow.Account = RecorderDataset.Ref;
					OCITransactionsRow.AmountRC = AccountOCI;
				EndIf;
				
				Selection = New Structure("Account, Balance");
				Selection.Insert("Account", RecorderDataset.Ref.Description);
				Selection.Insert("Balance", BalanceClosingRate);
				
				Bank.Parameters.Fill(Selection);
				SpreadsheetDocument.Put(Bank);				 
			EndIf;			
		EndDo;
	EndIf;
	
	// Inventory section
	
	InventoryBalance = 0;
	
	Inventory = Template.GetArea("Inventory");
	
	Query = New Query("SELECT
	                  |	ChartOfAccounts.Ref
	                  |FROM
	                  |	ChartOfAccounts.ChartOfAccounts AS ChartOfAccounts
	                  |WHERE
	                  |	ChartOfAccounts.AccountType = VALUE(Enum.AccountTypes.Inventory)
	                  |
	                  |ORDER BY
	                  |	ChartOfAccounts.Code");	
	
	QueryResult = Query.Execute();

	If QueryResult.IsEmpty() Then
	Else
		RecorderDataset = QueryResult.Choose();
		While RecorderDataset.Next() Do
			
			Filter = New Structure("Account", RecorderDataset.Ref);	
			RecordSelection = Reg.Balance(ReportDate,,Filter);
			
			NoOfRows = RecordSelection.Count();
			If NoOfRows = 0 Then
			Else
				Balance = 0;
				Balance = RecordSelection.Total("AmountRCBalanceDr") - RecordSelection.Total("AmountRCBalanceCr");
				InventoryBalance = InventoryBalance + Balance;
				
				Selection = New Structure("Account, Balance");
				Selection.Insert("Account", RecorderDataset.Ref.Description);
				Selection.Insert("Balance", Balance);
				
				Inventory.Parameters.Fill(Selection);
				SpreadsheetDocument.Put(Inventory);				 
			EndIf;			
		EndDo;
	EndIf;
	
	// AR
	
	ARBalance = 0;
	
	AR = Template.GetArea("AR");
	
	Query = New Query("SELECT
	                  |	ChartOfAccounts.Ref
	                  |FROM
	                  |	ChartOfAccounts.ChartOfAccounts AS ChartOfAccounts
	                  |WHERE
	                  |	ChartOfAccounts.AccountType = VALUE(Enum.AccountTypes.AccountsReceivable)
	                  |
	                  |ORDER BY
	                  |	ChartOfAccounts.Code");	
	
	QueryResult = Query.Execute();

	If QueryResult.IsEmpty() Then
	Else
		RecorderDataset = QueryResult.Choose();
		While RecorderDataset.Next() Do
			
			Filter = New Structure("Account", RecorderDataset.Ref);	
			RecordSelection = Reg.Balance(ReportDate,,Filter);
			
			NoOfRows = RecordSelection.Count();
			If NoOfRows = 0 Then
			Else
								
				AccountCurrency = RecorderDataset.Ref.Currency;
				ExchangeRate = GeneralFunctions.GetExchangeRate(Date, GeneralFunctionsReusable.DefaultCurrency(), AccountCurrency);

				BalanceClosingRate = 0;
				BalanceClosingRate = (RecordSelection.Total("AmountBalanceDr") - RecordSelection.Total("AmountBalanceCr")) * ExchangeRate; 
				
				Balance = 0;
				Balance = RecordSelection.Total("AmountRCBalanceDr") - RecordSelection.Total("AmountRCBalanceCr");
				
				ARBalance = ARBalance + BalanceClosingRate;
				
				AccountOCI = 0;
				AccountOCI = BalanceClosingRate - Balance;
				TotalOCI = TotalOCI + AccountOCI;
				
				If AccountOCI <> 0 Then						
					OCITransactionsRow = OCITransactions.Add();
					OCITransactionsRow.Account = RecorderDataset.Ref;
					OCITransactionsRow.AmountRC = AccountOCI;
				EndIf;
				
				Selection = New Structure("Account, Balance");
				Selection.Insert("Account", RecorderDataset.Ref.Description);
				Selection.Insert("Balance", BalanceClosingRate);
				
				AR.Parameters.Fill(Selection);
				SpreadsheetDocument.Put(AR);				 
			EndIf;			
		EndDo;
	EndIf;

	// Other current assets section
	
	OtherCurrentAssetsBalance = 0;
	
	OtherCurrentAssets = Template.GetArea("OtherCurrentAssets");
	
	Query = New Query("SELECT
	                  |	ChartOfAccounts.Ref
	                  |FROM
	                  |	ChartOfAccounts.ChartOfAccounts AS ChartOfAccounts
	                  |WHERE
	                  |	ChartOfAccounts.AccountType = VALUE(Enum.AccountTypes.OtherCurrentAsset)
	                  |
	                  |ORDER BY
	                  |	ChartOfAccounts.Code");	
	
	QueryResult = Query.Execute();

	If QueryResult.IsEmpty() Then
	Else
		RecorderDataset = QueryResult.Choose();
		While RecorderDataset.Next() Do
			
			Filter = New Structure("Account", RecorderDataset.Ref);	
			RecordSelection = Reg.Balance(ReportDate,,Filter);
			
			NoOfRows = RecordSelection.Count();
			If NoOfRows = 0 Then
			Else
				Balance = 0;
				Balance = RecordSelection.Total("AmountRCBalanceDr") - RecordSelection.Total("AmountRCBalanceCr");
				OtherCurrentAssetsBalance = OtherCurrentAssetsBalance + Balance;
				
				Selection = New Structure("Account, Balance");
				Selection.Insert("Account", RecorderDataset.Ref.Description);
				Selection.Insert("Balance", Balance);
				
				OtherCurrentAssets.Parameters.Fill(Selection);
				SpreadsheetDocument.Put(OtherCurrentAssets);				 
			EndIf;			
		EndDo;
	EndIf;

	// Total current assets section
	
	TotalCurrentAssetsBalance = BankBalance + InventoryBalance + ARBalance + OtherCurrentAssetsBalance;
	
	TotalCurrentAssets = Template.GetArea("TotalCurrentAssets");
	TotalCurrentAssets.Parameters.TotalCurrentAssets = TotalCurrentAssetsBalance;
	SpreadsheetDocument.Put(TotalCurrentAssets);

	// Noncurrent assets header section
	
	NoncurrentAssetsHeader = Template.GetArea("NoncurrentAssetsHeader");
	SpreadsheetDocument.Put(NoncurrentAssetsHeader);
	
	// Fixed assets section
	
	FixedAssetsBalance = 0;
	
	FixedAssets = Template.GetArea("FixedAssets");
	
	Query = New Query("SELECT
	                  |	ChartOfAccounts.Ref
	                  |FROM
	                  |	ChartOfAccounts.ChartOfAccounts AS ChartOfAccounts
	                  |WHERE
	                  |	ChartOfAccounts.AccountType = VALUE(Enum.AccountTypes.FixedAsset)
	                  |
	                  |ORDER BY
	                  |	ChartOfAccounts.Code");	
	
	QueryResult = Query.Execute();

	If QueryResult.IsEmpty() Then
	Else
		RecorderDataset = QueryResult.Choose();
		While RecorderDataset.Next() Do
			
			Filter = New Structure("Account", RecorderDataset.Ref);	
			RecordSelection = Reg.Balance(ReportDate,,Filter);
			
			NoOfRows = RecordSelection.Count();
			If NoOfRows = 0 Then
			Else
				Balance = 0;
				Balance = RecordSelection.Total("AmountRCBalanceDr") - RecordSelection.Total("AmountRCBalanceCr");
				FixedAssetsBalance = FixedAssetsBalance + Balance;
				
				Selection = New Structure("Account, Balance");
				Selection.Insert("Account", RecorderDataset.Ref.Description);
				Selection.Insert("Balance", Balance);
				
				FixedAssets.Parameters.Fill(Selection);
				SpreadsheetDocument.Put(FixedAssets);				 
			EndIf;			
		EndDo;
	EndIf;
	
	// Depreciation
	
	DepreciationBalance = 0;
	
	Depreciation = Template.GetArea("Depreciation");
	
	Query = New Query("SELECT
	                  |	ChartOfAccounts.Ref
	                  |FROM
	                  |	ChartOfAccounts.ChartOfAccounts AS ChartOfAccounts
	                  |WHERE
	                  |	ChartOfAccounts.AccountType = VALUE(Enum.AccountTypes.AccumulatedDepreciation)
	                  |
	                  |ORDER BY
	                  |	ChartOfAccounts.Code");	
	
	QueryResult = Query.Execute();

	If QueryResult.IsEmpty() Then
	Else
		RecorderDataset = QueryResult.Choose();
		While RecorderDataset.Next() Do
			
			Filter = New Structure("Account", RecorderDataset.Ref);	
			RecordSelection = Reg.Balance(ReportDate,,Filter);
			
			NoOfRows = RecordSelection.Count();
			If NoOfRows = 0 Then
			Else
				Balance = 0;
				Balance = RecordSelection.Total("AmountRCBalanceDr") - RecordSelection.Total("AmountRCBalanceCr");
				DepreciationBalance = DepreciationBalance + Balance;
				
				Selection = New Structure("Account, Balance");
				Selection.Insert("Account", RecorderDataset.Ref.Description);
				Selection.Insert("Balance", Balance);
				
				Depreciation.Parameters.Fill(Selection);
				SpreadsheetDocument.Put(Depreciation);				 
			EndIf;			
		EndDo;
	EndIf;

	// Other noncurrent assets section
	
	OtherNoncurrentAssetsBalance = 0;
	
	OtherNoncurrentAssets = Template.GetArea("OtherNoncurrentAssets");
	
	Query = New Query("SELECT
	                  |	ChartOfAccounts.Ref
	                  |FROM
	                  |	ChartOfAccounts.ChartOfAccounts AS ChartOfAccounts
	                  |WHERE
	                  |	ChartOfAccounts.AccountType = VALUE(Enum.AccountTypes.OtherNoncurrentAsset)
	                  |
	                  |ORDER BY
	                  |	ChartOfAccounts.Code");	
	
	QueryResult = Query.Execute();

	If QueryResult.IsEmpty() Then
	Else
		RecorderDataset = QueryResult.Choose();
		While RecorderDataset.Next() Do
			
			Filter = New Structure("Account", RecorderDataset.Ref);	
			RecordSelection = Reg.Balance(ReportDate,,Filter);
			
			NoOfRows = RecordSelection.Count();
			If NoOfRows = 0 Then
			Else
				Balance = 0;
				Balance = RecordSelection.Total("AmountRCBalanceDr") - RecordSelection.Total("AmountRCBalanceCr");
				OtherNoncurrentAssetsBalance = OtherNoncurrentAssetsBalance + Balance;
				
				Selection = New Structure("Account, Balance");
				Selection.Insert("Account", RecorderDataset.Ref.Description);
				Selection.Insert("Balance", Balance);
				
				OtherNoncurrentAssets.Parameters.Fill(Selection);
				SpreadsheetDocument.Put(OtherNoncurrentAssets);				 
			EndIf;			
		EndDo;
	EndIf;
	
	// Total noncurrent assets section
	
	TotalNoncurrentAssetsBalance = FixedAssetsBalance + DepreciationBalance + OtherNoncurrentAssetsBalance;
	
	TotalNoncurrentAssets = Template.GetArea("TotalNoncurrentAssets");
	TotalNoncurrentAssets.Parameters.TotalNoncurrentAssets = TotalNoncurrentAssetsBalance;
	SpreadsheetDocument.Put(TotalNoncurrentAssets);
	
	// Total assets section
	
	TotalAssetsBalance = TotalCurrentAssetsBalance + TotalNoncurrentAssetsBalance;
	
	TotalAssets = Template.GetArea("TotalAssets");
	TotalAssets.Parameters.TotalAssets = TotalAssetsBalance;
	SpreadsheetDocument.Put(TotalAssets);
	
	// Liabilities and stockholder equity header section
	
	LiabilitiesEquityHeader = Template.GetArea("LiabilitiesEquityHeader");
	SpreadsheetDocument.Put(LiabilitiesEquityHeader);

	// AP section
	
	APBalance = 0;
	
	AP = Template.GetArea("AP");
	
	Query = New Query("SELECT
	                  |	ChartOfAccounts.Ref
	                  |FROM
	                  |	ChartOfAccounts.ChartOfAccounts AS ChartOfAccounts
	                  |WHERE
	                  |	ChartOfAccounts.AccountType = VALUE(Enum.AccountTypes.AccountsPayable)
	                  |
	                  |ORDER BY
	                  |	ChartOfAccounts.Code");	
	
	QueryResult = Query.Execute();

	If QueryResult.IsEmpty() Then
	Else
		RecorderDataset = QueryResult.Choose();
		While RecorderDataset.Next() Do
			
			Filter = New Structure("Account", RecorderDataset.Ref);	
			RecordSelection = Reg.Balance(ReportDate,,Filter);
			
			NoOfRows = RecordSelection.Count();
			If NoOfRows = 0 Then
			Else
				
				AccountCurrency = RecorderDataset.Ref.Currency;
				ExchangeRate = GeneralFunctions.GetExchangeRate(Date, GeneralFunctionsReusable.DefaultCurrency(), AccountCurrency);

				BalanceClosingRate = 0;
				BalanceClosingRate = -1 * (RecordSelection.Total("AmountBalanceDr") - RecordSelection.Total("AmountBalanceCr")) * ExchangeRate; 

				Balance = 0;
				Balance = -1 * (RecordSelection.Total("AmountRCBalanceDr") - RecordSelection.Total("AmountRCBalanceCr"));
				
				APBalance = APBalance + BalanceClosingRate;
				
				AccountOCI = 0;
				AccountOCI = Balance - BalanceClosingRate; // reversed direction
				TotalOCI = TotalOCI + AccountOCI;
				
				If AccountOCI <> 0 Then						
					OCITransactionsRow = OCITransactions.Add();
					OCITransactionsRow.Account = RecorderDataset.Ref;
					OCITransactionsRow.AmountRC = AccountOCI;
				EndIf;
				
				Selection = New Structure("Account, Balance");
				Selection.Insert("Account", RecorderDataset.Ref.Description);
				Selection.Insert("Balance", BalanceClosingRate);
				
				AP.Parameters.Fill(Selection);
				SpreadsheetDocument.Put(AP);				 
			EndIf;			
		EndDo;
	EndIf;
	
	// Other current liabilities section
	
	OtherCurrentLiabilitiesBalance = 0;
	
	OtherCurrentLiabilities = Template.GetArea("OtherCurrentLiabilities");
	
	Query = New Query("SELECT
	                  |	ChartOfAccounts.Ref
	                  |FROM
	                  |	ChartOfAccounts.ChartOfAccounts AS ChartOfAccounts
	                  |WHERE
	                  |	ChartOfAccounts.AccountType = VALUE(Enum.AccountTypes.OtherCurrentLiability)
	                  |
	                  |ORDER BY
	                  |	ChartOfAccounts.Code");	
	
	QueryResult = Query.Execute();

	If QueryResult.IsEmpty() Then
	Else
		RecorderDataset = QueryResult.Choose();
		While RecorderDataset.Next() Do
			
			Filter = New Structure("Account", RecorderDataset.Ref);	
			RecordSelection = Reg.Balance(ReportDate,,Filter);
			
			NoOfRows = RecordSelection.Count();
			If NoOfRows = 0 Then
			Else
				Balance = 0;
				Balance = -1 * (RecordSelection.Total("AmountRCBalanceDr") - RecordSelection.Total("AmountRCBalanceCr"));
				OtherCurrentLiabilitiesBalance = OtherCurrentLiabilitiesBalance + Balance;
				
				Selection = New Structure("Account, Balance");
				Selection.Insert("Account", RecorderDataset.Ref.Description);
				Selection.Insert("Balance", Balance);
				
				OtherCurrentLiabilities.Parameters.Fill(Selection);
				SpreadsheetDocument.Put(OtherCurrentLiabilities);				 
			EndIf;			
		EndDo;
	EndIf;

	// Total current liabilities section
	
	TotalCurrentLiabilitiesBalance = APBalance + OtherCurrentLiabilitiesBalance;
	
	TotalCurrentLiabilities = Template.GetArea("TotalCurrentLiabilities");
	TotalCurrentLiabilities.Parameters.TotalCurrentLiabilities = TotalCurrentLiabilitiesBalance;
	SpreadsheetDocument.Put(TotalCurrentLiabilities);
	
	// Long term liabilities header section
	
	LongTermLiabilitiesHeader = Template.GetArea("LongTermLiabilitiesHeader");
	SpreadsheetDocument.Put(LongTermLiabilitiesHeader);
	
	// Long term liabilities section
	
	LongTermLiabilitiesBalance = 0;
	
	LongTermLiabilities = Template.GetArea("LongTermLiabilities");
	
	Query = New Query("SELECT
	                  |	ChartOfAccounts.Ref
	                  |FROM
	                  |	ChartOfAccounts.ChartOfAccounts AS ChartOfAccounts
	                  |WHERE
	                  |	ChartOfAccounts.AccountType = VALUE(Enum.AccountTypes.LongTermLiability)
	                  |
	                  |ORDER BY
	                  |	ChartOfAccounts.Code");	
	
	QueryResult = Query.Execute();

	If QueryResult.IsEmpty() Then
	Else
		RecorderDataset = QueryResult.Choose();
		While RecorderDataset.Next() Do
			
			Filter = New Structure("Account", RecorderDataset.Ref);	
			RecordSelection = Reg.Balance(ReportDate,,Filter);
			
			NoOfRows = RecordSelection.Count();
			If NoOfRows = 0 Then
			Else
				Balance = 0;
				Balance = -1 * (RecordSelection.Total("AmountRCBalanceDr") - RecordSelection.Total("AmountRCBalanceCr"));
				LongTermLiabilitiesBalance = LongTermLiabilitiesBalance + Balance;
				
				Selection = New Structure("Account, Balance");
				Selection.Insert("Account", RecorderDataset.Ref.Description);
				Selection.Insert("Balance", Balance);
				
				LongTermLiabilities.Parameters.Fill(Selection);
				SpreadsheetDocument.Put(LongTermLiabilities);				 
			EndIf;			
		EndDo;
	EndIf;
	
	// Total long term liabilities section
		
	TotalLongTermLiabilities = Template.GetArea("TotalLongTermLiabilities");
	TotalLongTermLiabilities.Parameters.TotalLongTermLiabilities = LongTermLiabilitiesBalance;
	SpreadsheetDocument.Put(TotalLongTermLiabilities);

	// Stockholder equity header section
	
	EquitySection = Template.GetArea("EquitySection");
	SpreadsheetDocument.Put(EquitySection);

	// Equity section
		
	EquityBalance = 0;
	
	Equity = Template.GetArea("Equity");
	
	Query = New Query("SELECT
	                  |	ChartOfAccounts.Ref
	                  |FROM
	                  |	ChartOfAccounts.ChartOfAccounts AS ChartOfAccounts
	                  |WHERE
	                  |	ChartOfAccounts.AccountType = VALUE(Enum.AccountTypes.Equity)
	                  |
	                  |ORDER BY
	                  |	ChartOfAccounts.Code");	
	
	QueryResult = Query.Execute();

	If QueryResult.IsEmpty() Then
	Else
		RecorderDataset = QueryResult.Choose();
		While RecorderDataset.Next() Do
			
			Filter = New Structure("Account", RecorderDataset.Ref);	
			RecordSelection = Reg.Balance(ReportDate,,Filter);
			
			NoOfRows = RecordSelection.Count();
			If NoOfRows = 0 Then
			Else
				Balance = 0;
				Balance = -1 * (RecordSelection.Total("AmountRCBalanceDr") - RecordSelection.Total("AmountRCBalanceCr"));
				EquityBalance = EquityBalance + Balance;
				
				Selection = New Structure("Account, Balance");
				Selection.Insert("Account", RecorderDataset.Ref.Description);
				Selection.Insert("Balance", Balance);
				
				Equity.Parameters.Fill(Selection);
				SpreadsheetDocument.Put(Equity);				 
			EndIf;			
		EndDo;
	EndIf;

	If TotalOCI <> 0 Then
		
		Selection = New Structure("Account, Balance");
		Selection.Insert("Account", "Other comprehensive income");
		Selection.Insert("Balance", TotalOCI);
		
		Equity.Parameters.Fill(Selection);
		SpreadsheetDocument.Put(Equity);				 

		EquityBalance = EquityBalance + TotalOCI;
		
	EndIf;
	
	// Retained earnings section
	
	IncomeBalance = 0;
		
	Query = New Query("SELECT
	                  |	ChartOfAccounts.Ref
	                  |FROM
	                  |	ChartOfAccounts.ChartOfAccounts AS ChartOfAccounts
	                  |WHERE
	                  |	ChartOfAccounts.AccountType = VALUE(Enum.AccountTypes.Income)
	                  |
	                  |ORDER BY
	                  |	ChartOfAccounts.Code");	
	
	QueryResult = Query.Execute();

	If QueryResult.IsEmpty() Then
	Else
		RecorderDataset = QueryResult.Choose();
		While RecorderDataset.Next() Do
			
			Filter = New Structure("Account", RecorderDataset.Ref);	
			RecordSelection = Reg.Balance(ReportDate,,Filter);
			
			NoOfRows = RecordSelection.Count();
			If NoOfRows = 0 Then
			Else
				Balance = 0;
				Balance = -1 * (RecordSelection.Total("AmountRCBalanceDr") - RecordSelection.Total("AmountRCBalanceCr"));
				IncomeBalance = IncomeBalance + Balance;
				
			EndIf;			
		EndDo;
	EndIf;

	CostOfSalesBalance = 0;
		
	Query = New Query("SELECT
	                  |	ChartOfAccounts.Ref
	                  |FROM
	                  |	ChartOfAccounts.ChartOfAccounts AS ChartOfAccounts
	                  |WHERE
	                  |	ChartOfAccounts.AccountType = VALUE(Enum.AccountTypes.CostOfSales)
	                  |
	                  |ORDER BY
	                  |	ChartOfAccounts.Code");	
	
	QueryResult = Query.Execute();

	If QueryResult.IsEmpty() Then
	Else
		RecorderDataset = QueryResult.Choose();
		While RecorderDataset.Next() Do
			
			Filter = New Structure("Account", RecorderDataset.Ref);	
			RecordSelection = Reg.Balance(ReportDate,,Filter);
			
			NoOfRows = RecordSelection.Count();
			If NoOfRows = 0 Then
			Else
				Balance = 0;
				Balance = RecordSelection.Total("AmountRCBalanceDr") - RecordSelection.Total("AmountRCBalanceCr");
				CostOfSalesBalance = CostOfSalesBalance + Balance;
				
			EndIf;			
		EndDo;
	EndIf;

	
	ExpensesBalance = 0;
		
	Query = New Query("SELECT
	                  |	ChartOfAccounts.Ref
	                  |FROM
	                  |	ChartOfAccounts.ChartOfAccounts AS ChartOfAccounts
	                  |WHERE
	                  |	ChartOfAccounts.AccountType = VALUE(Enum.AccountTypes.Expense)
	                  |
	                  |ORDER BY
	                  |	ChartOfAccounts.Code");	
	
	QueryResult = Query.Execute();

	If QueryResult.IsEmpty() Then
	Else
		RecorderDataset = QueryResult.Choose();
		While RecorderDataset.Next() Do
			
			Filter = New Structure("Account", RecorderDataset.Ref);	
			RecordSelection = Reg.Balance(ReportDate,,Filter);
			
			NoOfRows = RecordSelection.Count();
			If NoOfRows = 0 Then
			Else
				Balance = 0;
				Balance = RecordSelection.Total("AmountRCBalanceDr") - RecordSelection.Total("AmountRCBalanceCr");
				ExpensesBalance = ExpensesBalance + Balance;
				
			EndIf;			
		EndDo;
	EndIf;

	OtherIncomeBalance = 0;
		
	Query = New Query("SELECT
	                  |	ChartOfAccounts.Ref
	                  |FROM
	                  |	ChartOfAccounts.ChartOfAccounts AS ChartOfAccounts
	                  |WHERE
	                  |	ChartOfAccounts.AccountType = VALUE(Enum.AccountTypes.OtherIncome)
	                  |
	                  |ORDER BY
	                  |	ChartOfAccounts.Code");	
	
	QueryResult = Query.Execute();

	If QueryResult.IsEmpty() Then
	Else
		RecorderDataset = QueryResult.Choose();
		While RecorderDataset.Next() Do
			
			Filter = New Structure("Account", RecorderDataset.Ref);	
			RecordSelection = Reg.Balance(ReportDate,,Filter);
			
			NoOfRows = RecordSelection.Count();
			If NoOfRows = 0 Then
			Else
				Balance = 0;
				Balance = -1 * (RecordSelection.Total("AmountRCBalanceDr") - RecordSelection.Total("AmountRCBalanceCr"));
				OtherIncomeBalance = OtherIncomeBalance + Balance;
				
			EndIf;			
		EndDo;
	EndIf;

	OtherExpensesBalance = 0;
		
	Query = New Query("SELECT
	                  |	ChartOfAccounts.Ref
	                  |FROM
	                  |	ChartOfAccounts.ChartOfAccounts AS ChartOfAccounts
	                  |WHERE
	                  |	ChartOfAccounts.AccountType = VALUE(Enum.AccountTypes.OtherExpense)
	                  |
	                  |ORDER BY
	                  |	ChartOfAccounts.Code");	
	
	QueryResult = Query.Execute();

	If QueryResult.IsEmpty() Then
	Else
		RecorderDataset = QueryResult.Choose();
		While RecorderDataset.Next() Do
			
			Filter = New Structure("Account", RecorderDataset.Ref);	
			RecordSelection = Reg.Balance(ReportDate,,Filter);
			
			NoOfRows = RecordSelection.Count();
			If NoOfRows = 0 Then
			Else
				Balance = 0;
				Balance = RecordSelection.Total("AmountRCBalanceDr") - RecordSelection.Total("AmountRCBalanceCr");
				OtherExpensesBalance = OtherExpensesBalance + Balance;
				
			EndIf;			
		EndDo;
	EndIf;

	RetainedEarningsBalance = IncomeBalance - CostOfSalesBalance - ExpensesBalance + OtherIncomeBalance - OtherExpensesBalance;
	
	RetainedEarnings = Template.GetArea("RetainedEarnings");
	RetainedEarnings.Parameters.RetainedEarnings = RetainedEarningsBalance;
	SpreadsheetDocument.Put(RetainedEarnings);

	// Total equity section
		
	TotalEquity = Template.GetArea("TotalEquity");
	TotalEquity.Parameters.TotalEquity = EquityBalance + RetainedEarningsBalance;
	SpreadsheetDocument.Put(TotalEquity);

	// Total liabilities and equity section
		
	TotalLiabilitiesEquity = Template.GetArea("TotalLiabilitiesEquity");
	TotalLiabilitiesEquity.Parameters.TotalLiabilitiesEquity = TotalCurrentLiabilitiesBalance + LongTermLiabilitiesBalance + EquityBalance + RetainedEarningsBalance;
	SpreadsheetDocument.Put(TotalLiabilitiesEquity);

	// Creating OCI transactions
	
	If OCITransactions.Count() > 0 Then
	
		NewDocum = Documents.GeneralJournalEntry.CreateDocument();
		NewDocum.Currency = Constants.DefaultCurrency.Get();
		NewDocum.ExchangeRate = 1;
		NewDocum.Date = Date;
		NewDocum.Posted = False;
		NewDocum.DontWriteFCY = True;
		NewDocum.Memo = "Autogenerated by Balance Sheet";
		
		AccumulatedOCIAccount = Constants.AccumulatedOCIAccount.Get();
		
		AmountRC = 0;
		
		For i = 0 To OCITransactions.Count() - 1 Do
			
			LineItem = NewDocum.LineItems.Add();
			LineItem.Account = OCITransactions[i].Account;
			LineItem.AccountDescription = OCITransactions[i].Account.Description;
			
			LineItemAmount = OCITransactions[i].AmountRC;
			
			AmountRC = AmountRC + SQRT(POW((LineItemAmount),2));
			
			If OCITransactions[i].AmountRC > 0 Then
				LineItem.AmountDr = LineItemAmount;
				Corresponding = "Cr";
			Else
				LineItem.AmountCr = LineItemAmount * -1;
				Corresponding = "Dr";
			EndIf;
			
			LineItem = NewDocum.LineItems.Add();
			LineItem.Account = AccumulatedOCIAccount;
			LineItem.AccountDescription = AccumulatedOCIAccount.Description;
			If Corresponding = "Cr" Then
				LineItem.AmountCr = LineItemAmount;
			Else
				LineItem.AmountDr = LineItemAmount * -1;	
			EndIf;
			
		EndDo;
		
		NewDocum.DocumentTotal = AmountRC;
		NewDocum.DocumentTotalRC = AmountRC;	
		
		NewDocum.Write();

	EndIf;
	
	// Return result
	
	Return SpreadSheetDocument;
	
EndFunction
